[{"Title": "\n                                        Software Developer\n                                ", "Company": "SPECTRUM ", "Description": "TITLE. Software DeveloperLOCATION. Charlotte, North CarolinaJOB SUMMARY. Maintain the stability of.. Collaborate with team members to determine best practices and client requirements for software. Maintain..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Java and Devops Software Engineer / Application Developer - Contract\n                                ", "Company": "Verticalmove ", "Description": "Develop programming specifications. Design, code and unit test application code using Software Development Life Cycle (SDLC) best practices. Complete estimates and work plans with more senior..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Senior Software Developer – Full Stack\n                                ", "Company": "BDO ", "Description": "Senior Software Developer. Full Stack (Remote. Nationwide) Charlotte North Carolina 26686BR Job Summary.. to combine teamwork with technology to produce amazing results.The Experienced Senior Software Developer..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        OFSAA Credit Risk Developer / Sr. Software Engineer, Associate Vice President - Hybrid/NC\n                                ", "Company": "MUFG ", "Description": "A member of our recruitment team will discuss the options with you in more detail.In this role you will apply your technical expertise to all aspects of the software development lifecycle, as..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Software Developer in Test (Fidelity Labs Startup)\n                                ", "Company": "Fidelity Investments ", "Description": "Job Description The RoleFidelity Labs is looking for a Software Developer in Test to join a newly founded startup. As a key member of a small and growing engineering team, this role will be..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Associate Robotics Software Developer\n                                ", "Company": "Brooksource ", "Description": "Brooksource is searching for an Associate Robotics Process Automation Software Engineer for our Fortune.. This is the ideal opportunity for a passionate developer with a strong infrastructure background to get..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        SQL Developer - Technology & Data - Senior Software Engineer\n                                ", "Company": "Artech LLC ", "Description": "SQL Developer. Must Have. 8. years of MS SQL server experience in designing, coding and delivering.. Required Qualifications. 4. years of Software Engineering experience, or equivalent demonstrated through..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Software Developer\n                                ", "Company": "Everlight Solar ", "Description": "Everlight Solar is seeking a talented Software Developer to serve as a member of the software.. You will aid in the innovation and creation of company software and programs, work alongside a team of..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Software Developer (Java\n                                ", "Company": "Equitable ", "Description": "Ability to apply appropriate agile approaches in the processes of software development and delivery.. Software Development. Knowledge of software development tools and activities. ability to produce..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Software Developer, Sr\n                                ", "Company": "Tech Providers, Inc. ", "Description": "Position. Sr Software DeveloperLocation. (100. Remote)Duration. 3. months Contract (High possibility.. Job Summary. The Drupal Developer Administrator will be responsible for full stack activities developing..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Software Developer\n                                ", "Company": "University of North Carolina at Charlotte ", "Description": "Position Information. General Information Position Number STMP18 Working Title Software Developer Division Department Work Unit Bioinformatics and Genomics Work Location NC Research Campus..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        100% Remote Senior Python Full Stack Software Developer\n                                ", "Company": "Us Staffing Adj, Inc ", "Description": "Job title. 100. Remote Senior Python Full Stack Software DeveloperCompany. Talent Acquisition.. We are seeking a Senior Full Stack Software Developer to join our talented team in developing the next..", "Location": "Remote • Charlotte, North Carolina"}, {"Title": "\n                                        Software/API Developer III\n                                ", "Company": "Blue Chip Talent ", "Description": "Software API Developer III Position Summary Blue Chip Talent has a great opportunity in the Charlotte.. Qualifications and Required Experience for Software API Developer III. Knowledge about API design..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Software Developer II (Angular)\n                                ", "Company": "Avison Young ", "Description": "After all, we are powered by people. Overview As a Software Developer at Avison Young, you will be at.. Responsibilities We are seeking a Software Engineer Developer to join our dynamic and energetic product..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Software Developer - UX\n                                ", "Company": "Compunnel ", "Description": "Description Requirements We have 10 roles that range in years of experience. Please send me Junior. Lead Developers with Java & Android Minimum QualificationsBachelor's Degree in Computer..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Software Developer in Test / Ruby/RSpec/Capybara\n                                ", "Company": "Motion Recruitment ", "Description": "Job Description A top tier FinTech company is looking for a Software Engineer in Test to join their team.. This position is a full time opportunity and fully remote! The Software Engineer in Test will work..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Software Engineer I- .Net Developer\n                                ", "Company": "Truist ", "Description": "Specific activities may change from time to time. 1. Customize coding, software integration, perform.. High School diploma or GED Knowledge of programming software applications with up to four years of..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Assistant Software Developer\n                                ", "Company": "Fujitsu ", "Description": "Sybase and or MS SQL and have good understanding of RDBMS concepts and SQL Understand Software as a.. 000 11000 PLN gross We're looking for Java developer to team working on server plug ins for popular..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Sr. Software Developer\n                                ", "Company": "Charles Schwab ", "Description": "Your Opportunity We are looking for a talented Sr. Software Developer to join the Digital Accelerator.. application development experience and experience mentoring assisting junior team developers on team..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Lead Software Developer\n                                ", "Company": "ThoughtWorks ", "Description": "They've also been writing books, speaking at conferences and helping push software development forward.. As a Lead Developer, you will bring a strategic mindset to projects and spend time negotiating with..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        US_East | Software Developer - Microsoft technologies_L3\n                                ", "Company": "Enterprise Solutions, Inc. ", "Description": "Timeslots for Skype interview (provide Skype ID). Job description. Angular Developer. & 149. 7.. Cooperating with the back end developer in the process of building the RESTful API,. Communicating with..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Software Developer\n                                ", "Company": "Harris Computer ", "Description": "EIS (Executive Information Services) is seeking a Software DeveloperThis job is a great opportunity to.. years of hands on software development.Exceptional software development experience using Microsoft..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Software Developer- Remote\n                                ", "Company": "Honeywell ", "Description": "This position will be in Kansas City, MO. Summary Honeywell Federal Manufacturing & Technologies (FM&T) is seeking a Software Developer to join a team that seeks challenges, loves learning..", "Location": "Remote • Charlotte, North Carolina"}, {"Title": "\n                                        JMP Software Developer (C++)\n                                ", "Company": "SAS ", "Description": "What we do. We're the leader in analytics. Through our software and services, we inspire customers.. We are looking to hire a Software Developer in to the JMP team who will be responsible for writing and..", "Location": "Charlotte, North Carolina"}, {"Title": "\n                                        Software Developer (New Grad)\n                                ", "Company": "BMO ", "Description": "Group TechnologyUnderstands that the success of a developer is to understand the core business processes.. Conceive and write detailed software implementations code while ensuring that their code configurations..", "Location": "1, Charlotte, North Carolina"}, {"Title": "\n                                        IT - Software Developer Specialty 4\n                                ", "Company": "Genesis10 ", "Description": "Job DescriptionGenesis10 is currently seeking an IT. Software Developer Specialty 4 Consultant with our client in the financial industry. This role is 100. remote and is a 12 month. contract..", "Location": "Charlotte, North Carolina"}]